Repository: Eslzzyl/Pixiv-SwiftUI
Catalog: Pixiv-SwiftUI/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

source: 自动更新
en: 自动Update
ja: 自動更新
zh_hant: 自動更新

source: 自动预取图片
en: Auto-prefetch Images
ja: 画像を自動で先読み
zh_hant: 自動預取圖片

source: 自定义主题色
en: Custom主题色
ja: テーマカラーをカスタマイズ
zh_hant: 自訂主題色

source: 自定义代理
en: Custom Proxy
ja: プロキシをカスタマイズ
zh_hant: 自訂代理

source: 自定义颜色
en: Custom颜色
ja: 色をカスタマイズ
zh_hant: 自訂顏色

source: 行距
en: Line Spacing
ja: 行間

source: 覆盖
en: Overwrite
ja: 上書き
zh_hant: 覆蓋

source: 解释图片
en: Explain Image
ja: 画像を解説
zh_hant: 解釋圖片

source: 设置
en: Settings
ja: 設定
zh_hant: 設定

source: 设置...
en: Settings…
ja: 設定…
zh_hant: 設定…

source: 设置下载相关选项
en: Configure download options
ja: ダウンロード関連のオプションを設定
zh_hant: 設定下載相關選項

source: 评论
en: Comments
ja: コメント
zh_hant: 留言

source: 译文
en: Translation
ja: 翻訳文
zh_hant: 譯文

source: 该作者还没有发布小说
en: This artist hasn't published any novels yet
ja: この作者はまだ小説を投稿していません
zh_hant: 該作者尚未發佈小說

source: 该作者还没有发布插画
en: This artist hasn't published any illustrations yet
ja: この作者はまだイラストを投稿していません
zh_hant: 該作者尚未發佈插畫

source: 该作者还没有发布漫画
en: This artist hasn't published any manga yet
ja: この作者はまだ漫画を投稿していません
zh_hant: 該作者尚未發佈漫畫

source: 该用户还没有收藏任何作品
en: This user hasn't bookmarked any works yet
ja: このユーザーはまだ作品をブックマークしていません
zh_hant: 該使用者尚未收藏任何作品

source: 详细信息
en: Details
ja: 詳細情報
zh_hant: 詳細資訊

source: 说点什么...
en: Say something...
ja: コメントを入力…
zh_hant: 說點什麼…

source: 请先登录
en: Please login first
ja: 先にログインしてください
zh_hant: 請先登入

source: 请先登录以使用搜索
en: Please login to use search
ja: 検索を使用するにはログインしてください
zh_hant: 請先登入以使用搜尋

source: 请在百度翻译开放平台申请 AppID 和 API Key。
en: Please apply for AppID and API Key on Baidu Translation Open Platform.
ja: Baidu翻訳オープンプラットフォームでAppIDとAPIキーを申請してください。
zh_hant: 請在百度翻譯開放平台申請 AppID 和 API 金鑰。

source: 请在腾讯云控制台申请 Secret ID 和 Secret Key。
en: Please apply for Secret ID and Secret Key in Tencent Cloud Console.
ja: Tencent CloudコンソールでSecret IDとSecret Keyを申請してください。
zh_hant: 請在騰訊雲主控台申請 Secret ID 和 Secret Key。

source: 请填写代理配置并选择“保存并启用代理”
en: Enter the proxy configuration, then select “Save and Enable Proxy”.
ja: プロキシ設定を入力し、「保存してプロキシを有効にする」を選択してください
zh_hant: 請填寫代理設定並選擇「儲存並啟用代理」

source: 请登录后查看相关推荐
en: Please login to view related recommendations
ja: 関連するおすすめを見るにはログインしてください
zh_hant: 請登入後檢視相關推薦

source: 请输入代理服务器地址
en: Enter a proxy server address.
ja: プロキシサーバーアドレスを入力してください
zh_hant: 請輸入代理伺服器位址

source: 请输入类似 xxxx_xxxx 的 Cookie 值
en: Please Enter类似 xxxx_xxxx 的 Cookie 值
ja: xxxx_xxxxのようなCookie値を入力してください
zh_hant: 請輸入類似 xxxx_xxxx 的 Cookie 值

source: 请选择一个项目
en: Please select an item
ja: プロジェクトを1つ選択してください
zh_hant: 請選擇一個專案

source: 读取图片失败
en: 读取图片Failed
ja: 画像の読み込みに失敗しました
zh_hant: 讀取圖片失敗

source: 账户
en: Account
ja: アカウント
zh_hant: 帳戶

source: 账户信息
en: Account Info
ja: アカウント情報
zh_hant: 帳戶資訊

source: 跟随系统
en: Follow System
ja: システムに従う
zh_hant: 跟隨系統

source: 轻触翻译
en: Tap to Translate
ja: タップして翻訳
zh_hant: 輕觸翻譯

source: 输入您的 PHPSESSID（可选）
en: 输入您的 PHPSESSID（Optional）
ja: PHPSESSIDを入力（任意）
zh_hant: 輸入您的 PHPSESSID（選填）

source: 输入您的 refresh_token（必填）
en: 输入您的 refresh_token（Required）
ja: refresh_tokenを入力（必須）
zh_hant: 輸入您的 refresh_token（必填）

source: 边距
en: Margin
ja: 余白
zh_hant: 邊距

source: 达到段落数或字符数上限时会切分批次，跨批次上下文可帮助模型保持人名和语气一致。
en: 达到段落数或字符数上限时会切分批次，跨批次上下文可Help模型保持人名和语气一致。
ja: 段落数または文字数の上限に達するとバッチを分割します。バッチ間の文脈により、モデルは人名や語調を一貫して保てます。
zh_hant: 達到段落數或字元數上限時會切分批次，跨批次上下文可協助模型維持人名和語氣一致。

source: 过滤
en: Filter
ja: フィルター
zh_hant: 篩選

source: 过滤与屏蔽
en: Filter & Block
ja: フィルターとブロック
zh_hant: 篩選與封鎖

source: 这将删除所有下载和已保存的文件。
en: This will delete all downloaded and saved files.
ja: ダウンロード済みおよび保存済みのファイルをすべて削除します。
zh_hant: 這將刪除所有下載和已儲存的檔案。

source: 这将删除所有已完成的任务和已保存的文件。
en: This will delete all completed tasks and saved files.
ja: 完了したタスクと保存済みのファイルをすべて削除します。
zh_hant: 這將刪除所有已完成的任務和已儲存的檔案。

source: 远端目录
en: 远端Directory
ja: リモートディレクトリ
zh_hant: 遠端目錄

source: 远端路径
en: 远端Path
ja: リモートパス
zh_hant: 遠端路徑

source: 连载中
en: Ongoing
ja: 連載中
zh_hant: 連載中

source: 退出登录
en: Logout
ja: ログアウト
zh_hant: 退出登入

source: 选择图片开始翻译
en: Select an Image to Start Translation
ja: 画像を選択して翻訳を開始
zh_hant: 選擇圖片開始翻譯

source: 选择导出方式
en: Select Export Method
ja: 書き出し方法を選択
zh_hant: 選擇匯出方式

source: 选择标签翻译的显示方式。
en: Choose how to display tag translations.
ja: タグ翻訳の表示方法を選択します。
zh_hant: 選擇標籤翻譯的顯示方式。

source: 选择用于翻译文本的服务。
en: Select the service used for text translation.
ja: テキスト翻訳に使用するサービスを選択します。
zh_hant: 選擇用於翻譯文字的服務。

source: 选择界面主题模式
en: Choose interface theme mode
ja: インターフェースのテーマモードを選択
zh_hant: 選擇介面主題模式

source: 选择表情
en: Select Emoji
ja: スタンプを選択
zh_hant: 選擇表情符號

source: 选择颜色
en: 选择Color
ja: 色を選択
zh_hant: 選擇顏色

source: 通用
en: General
ja: 一般
zh_hant: 一般

source: 通过手动输入 Cookie 中的 PHPSESSID 字段来登录 Web API。
en: 通过手动输入 Cookie 中的 PHPSESSID 字段来Login Web API。
ja: CookieのPHPSESSIDフィールドを手動入力してWeb APIにログインします。
zh_hant: 透過手動輸入 Cookie 中的 PHPSESSID 欄位來登入 Web API。

source: 通过绕过 SNI 嗅探来实现免代理直连 Pixiv。
en: Bypasses SNI probing to achieve proxy-free direct connection to Pixiv.
ja: SNIスニッフィングを回避して、プロキシなしでPixivに直接接続します。
zh_hant: 透過繞過 SNI 嗅探來實現免代理直連 Pixiv。

source: 通过网页登录
en: 通过网页Login
ja: ウェブログイン
zh_hant: 透過網頁登入

source: 通过网页登录（推荐）
en: Log in via Pixiv (Recommended)
ja: ウェブログイン（推奨）
zh_hant: 透過網頁登入（推薦）

source: 通过网页获取凭证
en: 通过Web获取凭证
ja: ウェブから認証情報を取得
zh_hant: 透過網頁取得憑證

source: 邮箱
en: Email
ja: メールアドレス
zh_hant: 電子郵件

source: 配置 OpenAI 或兼容的 LLM 服务。API Key 为必填项，不配置将无法使用此服务。
en: Configure OpenAI or compatible LLM service. API Key is required, this service cannot be used without configuration.
ja: OpenAIまたは互換性のあるLLMサービスを設定します。APIキーは必須です。設定しないとこのサービスは使用できません。
zh_hant: 設定 OpenAI 或相容的 LLM 服務。API Key 為必填項目，未設定將無法使用此服務。

source: 重新登录
en: Log In Again
ja: 再ログイン
zh_hant: 重新登入

source: 重置
en: Reset
ja: リセット
zh_hant: 重設

source: 重置为默认提示词
en: 重置为Default提示词
ja: デフォルトのプロンプトに戻す
zh_hant: 重設為預設提示詞

source: 重置所有设置
en: Reset All Settings
ja: すべての設定をリセット
zh_hant: 重設所有設定

source: 重试
en: Retry
ja: 再試行
zh_hant: 重試

source: 链接
en: Link
ja: リンク
zh_hant: 連結

source: 错误
en: Error
ja: エラー
zh_hant: 錯誤

source: 阅读设置
en: Reading Settings
ja: 読書設定
zh_hant: 閱讀設定

source: 隐藏凭证
en: Hide Credential
ja: 認証情報を隠す
zh_hant: 隱藏憑證

source: 隐藏表情
en: Hide Emoji
ja: スタンプを隠す
zh_hant: 隱藏表情符號

source: 非公开
en: Private
ja: 非公開
zh_hant: 非公開

source: 非公开收藏
en: Private Like
ja: 非公開ブックマーク
zh_hant: 非公開收藏

source: 页数: %lld
en: Pages: %lld
ja: ページ数：%lld
zh_hant: 頁數：%lld

source: 项目 ID
en: Project ID
ja: プロジェクトID
zh_hant: 專案 ID

source: 首行缩进
en: First Line Indent
ja: 先頭行の字下げ
zh_hant: 首行縮排

source: 高
en: High

source: 默认启动标签页
en: Default启动标签页
ja: デフォルトの起動タブ
zh_hant: 預設啟動標籤頁

source: 默认搜索排序
en: Default Search Sort
ja: デフォルトの検索順
zh_hant: 預設搜尋排序

source: 默认私密收藏
en: Default Private Bookmark
ja: デフォルトで非公開ブックマーク
zh_hant: 預設私密收藏

# @%@ · ID %@
source: @%1$@ · ID %2$@
ja: @%@ · ID %@
zh_hant: @%@ · ID %@

source: %lld 项
ja: %lld項目
zh_hant: %lld 項

source: PHPSESSID (需包含下划线)
ja: PHPSESSID（アンダースコアを含む）
zh_hant: PHPSESSID（需包含底線）

source: Unknown
ja: 不明
zh_hant: 未知

source: 亮点
ja: ハイライト
zh_hant: 亮點

source: 以图搜图
ja: 画像で検索
zh_hant: 以圖搜圖

source: 作者最新作品
ja: 作者の最新作品

source: 关闭后详情页标签将严格按照 API 返回顺序排列。
ja: オフにすると、詳細ページのタグはAPIが返す順序に並びます。
zh_hant: 關閉後詳細頁標籤將嚴格按照 API 回傳順序排列。

source: 切换侧边栏
ja: サイドバーを切り替え
zh_hant: 切換側邊欄

source: 前文上下文段落
ja: 前方コンテキスト段落数
zh_hant: 前文上下文段落數

source: 单批最大字符
ja: 1バッチあたりの最大文字数
zh_hant: 單批最大字元

source: 单批最大段落
ja: 1バッチあたりの最大段落数
zh_hant: 單批最大段落

source: 并发批次
ja: 同時バッチ数
zh_hant: 並行批次

source: 无法打开已删除的收藏记录
ja: 削除されたブックマーク記録を開けません
zh_hant: 無法開啟已刪除的收藏記錄

source: 无过滤
ja: フィルターなし
zh_hant: 無篩選

source: 查找
ja: 検索
zh_hant: 尋找

source: 查看
ja: 表示
zh_hant: 檢視

source: 查看更多
ja: さらに表示
zh_hant: 檢視更多

source: 缓存记录不可用
ja: キャッシュ記録を利用できません
zh_hant: 快取記錄不可用

source: 详情页标签紧凑重排
ja: 詳細ページのタグを詰めて並べ替える
zh_hant: 詳細頁標籤緊湊重排

source: 输入 PHPSESSID
ja: PHPSESSIDを入力
zh_hant: 輸入 PHPSESSID
